---
kind: type
id: T:Autodesk.Revit.DB.ProjectInfo
source: html/e90b12f3-9bf4-f536-3556-c9944cbf9f38.htm
---
# Autodesk.Revit.DB.ProjectInfo

An object that represents a Project Information within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class ProjectInfo : Element
```

## Remarks
This object derived from the Element base object and such supports all the
methods of that object such as the ability to retrieve the parameters of that object.